#include <stdio.h>

/*
嵌套循环的使用：

1、嵌套循环：一个循环结构A的循环体是另一个循环结构B

循环结构A:外层循环
循环结构B:内层循环

2、技巧：外层循环控制行数，内层循环控制列数

3、公式：如果外层循环执行m次，内层循环执行n次，则内层循环的循环体一共执行：m * n次
 */
int main()
{

    /*

    **********
    **********
    **********
    **********
    **********

    */

    for (int j = 1; j <= 5; j++)
    {
        for (int i = 1; i <= 10; i++)
        {
            printf("*");
        }
        printf("\n");
    }

    /*
            i   j的最大值（即*的个数）
    *       1   1
    **      2   2
    ***     3   3
    ****    4   4
    *****   5   5

    */

    for (int i = 1; i <= 5; i++)
    {
        for (int j = 1; j <= i; j++)
        {
            printf("*");
        }
        printf("\n");
    }

    /*
            i  j的最大值（即*的个数）    i + j的最大值 = 6 ---> j的最大值 = 6 - i
    *****   1   5
    ****    2   4
    ***     3   3
    **      4   2
    *       5   1
                           2*i + j = 7  --> j = 7 - 2*i
    *****   1   5
    ***     2   3
    *       3   1

    */

    for (int i = 1; i <= 5; i++)
    {
        for (int j = 1; j <= 6 - i; j++)
        {
            printf("*");
        }
        printf("\n");
    }

    /*
                    上半部分
                    i   j的最大值(-的个数)   k的最大值(* 的个数)     j的最大值 = 10 - 2*i;
--------*           1   8                   1                     k的最大值 = 2*i - 1;
------* * *         2   6                   3
----* * * * *       3   4                   5
--* * * * * * *     4   2                   7
* * * * * * * * *   5   0                   9

                    下半部分
                                                        j的最大值 = 2*i
--* * * * * * *     1   2                   7           k的最大值 = 9-2*i
----* * * * *       2   4                   5
------* * *         3   6                   3
--------* 	        4   8                   1
     */
    for (int i = 1; i <= 5; i++)
    {
        // 遍历-
        for (int j = 1; j <= 10 - 2 * i; j++)
        {
            printf(" ");
        }
        // 遍历*
        for (int k = 1; k <= 2 * i - 1; k++)
        {
            printf("* ");
        }
        printf("\n");
    }

    for (int i = 1; i <= 4; i++)
    {
        // 遍历-
        for (int j = 1; j <= 2 * i; j++)
        {
            printf(" ");
        }
        // 遍历*
        for (int k = 1; k <= 9 - 2 * i; k++)
        {
            printf("* ");
        }
        printf("\n");
    }
    return 0;
}