#include <stdio.h>

/* 
运算符之一：算术运算符的使用

1、+ -  +  -  *  /  %  (前)++  (后)++  (前)--  (后)--  

 */

int main()
{

    int i1 = 10;
    short s1 = 10;
    int i2 = i1 * s1;

    // / : 
    int i3 = 12;
    int i4 = 5;
    int i5 = i3 / i4; 
    printf("结果为：%d\n",i5);  //2

    int i6 = i3 / i4 * i4;
    printf("结果为：%d\n",i6); //10

    //如果希望结果是2.4如何操作？
    double d1 = i3 / i4 ;  //2.000000
    double d2 = i3 / i4 + 0.0; //2.000000
    double d3 = i3 / (i4 + 0.0); //2.400000
    double d4 = (double)i3 / i4;  //2.400000
    double d5 = (double)(i3 / i4);  //2.000000

    // % : 取模、取余
    //结果的符号与被模数的符号相同
    printf("14 % 5 结果为：%d\n",(14 % 5));
    printf("14 % -5 结果为：%d\n",(14 % -5));
    printf("-14 % 5 结果为：%d\n",(-14 % 5));
    printf("-14 % -5 结果为：%d\n",(-14 % -5));

    //应用场景：判断一个整数是否是偶数？奇数？  num % 2 == 0

    /* 
    (前)++  : 先自增1，后运算
    (后)++  : 先运算，后自增1
    
    ++操作不会改变本身变量的数据类型。
     */
    int m1 = 10;
    int n1 = ++m1;
    printf("m1 = %d,n1 = %d\n",m1,n1);  //m1 = 11,n1 = 11

    int m2 = 10;
    int n2 = m2++;
    printf("m2 = %d,n2 = %d\n",m2,n2); //m2 = 11,n2 = 10


    short ss1 = 10;
    //int ii1 = ss1++;

    printf("占用的字节数为：%zu \n",sizeof(ss1++));   //2
    printf("占用的字节数为：%zu \n",sizeof(ss1 + 1)); //4


    /* 
    (前)--  : 先自减1，后运算
    (后)--  : 先运算，后自减1
     */

    //练习：定义一个变量，值为10，让其实现+1的行为。
    //方式1：
    int num1 = 10;
    num1 = num1 + 1;

    //方式2：如下的(前)++ 和 (后)++ 没有区别
    int num2 = 10;
    num2++;
    //++num2;

    return 0;
}