#include <stdio.h>

/*
运算符之五：位运算符的使用

1、 <<   >>   &  |  ^  ~

2、说明
>    上述的操作符都是针对于整数进行的，且是在其二进制数据中进行的操作
>    << ：不管是正数还是负数，在一定范围内，每向左移动一位，就 * 2
>    >> : 不管是正数还是负数，在一定范围内，每向右移动一位，就 / 2


3、经典的笔试题：高效的方式计算 2 * 8 
   2 << 3  或 8 << 1
*/

int main()
{
    printf("12 << 1 结果是：%d\n",(12 << 1));
    printf("12 << 2 结果是：%d\n",(12 << 2));
    printf("12 << 3 结果是：%d\n",(12 << 3));

    printf("-12 << 1 结果是：%d\n",(-12 << 1));
    printf("-12 << 2 结果是：%d\n",(-12 << 2));
    printf("-12 << 3 结果是：%d\n",(-12 << 3));

    printf("12 << 27 结果是：%d\n",(12 << 27)); //1610612736
    printf("12 << 28 结果是：%d\n",(12 << 28)); //-1073741824

    //***************************
    printf("45 >> 1 结果是：%d\n",(45 >> 1));
    printf("45 >> 2 结果是：%d\n",(45 >> 2));
    printf("45 >> 3 结果是：%d\n",(45 >> 3));
    printf("45 >> 4 结果是：%d\n",(45 >> 4));

    printf("-45 >> 1 结果是：%d\n",(-45 >> 1));
    printf("-45 >> 2 结果是：%d\n",(-45 >> 2));
    printf("-45 >> 3 结果是：%d\n",(-45 >> 3));
    printf("-45 >> 4 结果是：%d\n",(-45 >> 4));

    return 0;
}